Repository: AhmedHazem02/deliverzler
Catalog: lib/l10n/app_*.arb
Languages: ar

# fontFamily
source: Poppins
ar: Tajawal

source: No internet connection
ar: لا يوجد اتصال بالانترنت

# screenNotFound
source: Oops! Screen not found!
ar: عذرًا! لم يتم العثور على الصفحة!

source: Go to Home
ar: الذهاب للصفحة الرئيسية

# pleaseCheckYourDeviceNetwork
source: Please check your device"s network connection.
ar: الرجاء إصلاح اتصالك بالانترنت.

source: Retry
ar: إعادة المحاولة

# ops_err
source: Oops! Something went wrong!
ar: لقد حدث خطأ ما!

source: Please try again!
ar: الرجاء المحاولة مرة أخرى!

source: Please try again later!
ar: الرجاء المحاولة لاحقاً!

source: You are currently offline.
ar: أنت غير متصل بالإنترنت حالياً.

# youAreBackOnline
source: Your are back online.
ar: تمت استعادة الاتصال بالإنترنت.

# unauthorizedError
source: Account not found or password invalid
ar: الحساب غير موجود أو كلمة المرور غير صالحة

# forbiddenError
source: You don't have permission to access this service
ar: ليس لديك صلاحية الوصول لهذه الخدمة

# notFoundError
source: Request page not found. Please contact support for more details.
ar: صفحة الطلب غير موجودة. يرجى التواصل مع الدعم لمزيد من التفاصيل.

# conflictError
source: The request could not be processed because of conflict in the request. Please try again later.
ar: لقد حدث تضارب في معالجة الطلب. يرجى إعادة المحاولة لاحقاً.

# internalError
source: Internal server error. Please contact support for more details.
ar: خطأ داخلي في الخادم. يرجى التواصل مع الدعم لمزيد من التفاصيل.

# serviceUnavailableError
source: The server is temporarily unavailable. Please try again later.
ar: الخادم غير قادر مؤقتاً على معالجة الطلب. يرجى إعادة المحاولة لاحقاً.

# timeoutError
source: Looks like the server is taking too long to respond. This can be caused by either poor connectivity or an error with our servers. Please try again in a while.
ar: يبدو أن الخادم يستغرق وقتًا طويلاً للاستجابة ، وقد يكون السبب في ذلك إما ضعف الاتصال أو خطأ في خوادمنا. يرجى المحاولة مرة أخرى بعد فترة.

# noInternetError
source: No Internet connection. Make sure Wi-Fi or cellular data is turned on, then try again.
ar: لا يتوفر اتصال بالانترنت. يرجى التحقق من الاتصال وإعادة المحاولة.

# unknownError
source: Unexpected error occurred!
ar: لقد حدث خطأ ما!

# authInvalidEmailError
source: Your email is not valid. Please enter a valid email.
ar: البريد غير صالح. يرجى إدخال بريد الكتروني صحيح.

# authWrongPasswordError
source: Your password is incorrect. Please try again.
ar: كلمة المرور غير صحيح. حاول مرة أخرى!

# authUserNotFoundError
source: User with this email doesn't exist.
ar: لا يوجد مستخدم بهذا البريد. يرجى إدخال بريد الكتروني آخر.

# authUserDisabledError
source: Your account has been disabled. Please contact support.
ar: لقد تم إيقاف حسابك. يرجى التواصل مع الدعم.

source: Something went wrong.
ar: لقد حدث خطاً.

# operationCanceledByUser
source: Operation was canceled by user
ar: تم إلغاء الأمر بواسطة المستخدم

source: Loading...
ar: جارِ التحميل...

source: This field is empty
ar: هذا الحقل فارغ

# pleaseEnterValidNumber
source: Please enter a valid mobile number
ar: الرجاء ادخال رقم هاتف صحيح

# pleaseEnterValidEmail
source: Please enter a valid email address
ar: الرجاء ادخال بريد الكتروني صحيح

# pleaseEnterValidName
source: Please enter a valid name
ar: الرجاء ادخال اسم صحيح

source: Name must be at least 2 Letters
ar: الاسم لا يمكن أن يكون أقل من حرفين

source: Name must be at most 30 Letters
ar: الاسم لا يمكن أن يتخطى ٣٠ حرف

source: Cancel
ar: إلغاء

source: Confirm
ar: تأكيد

source: Back
ar: الرجوع

source: Edit
ar: تعديل

# continue2
source: Continue
ar: استمرار

source: Log out
ar: تسجيل الخروج

source: OK
ar: حسناً

source: Name
ar: الاسم

source: Choose Option
ar: اختر طريقة التقاط الصورة

source: Camera
ar: الكاميرا

source: Gallery
ar: المعرض

# timeout_error
source: Looks like the server is taking to long to respond, this can be caused by either poor connectivity or an error with our servers. Please try again in a while
ar: يبدو أن الخادم يستغرق وقتًا طويلاً للاستجابة ، وقد يكون السبب في ذلك إما ضعف الاتصال أو خطأ في خوادمنا. يرجى المحاولة مرة أخرى بعد فترة

# error_1000
source: App Server Error, please contact support.
ar: خطأ في خادم التطبيق ، يرجى التواصل مع الدعم.

# error_401
source: Account not found or password invalid
ar: الحساب غير موجود أو كلمة المرور غير صالحة

# error_403
source: forbidden
ar: ممنوع

# error_404
source: Request page not found please contact support for more details.
ar: صفحة الطلب غير موجودة يرجى التواصل مع الدعم لمزيد من التفاصيل.

# error_479
source: Session expired, please login again
ar: انتهت الجلسة ، يرجى تسجيل الدخول مرة أخرى

# error_500
source: Internal server error, please contact support for more details.
ar: خطأ داخلي في الخادم ، يرجى التواصل مع الدعم لمزيد من التفاصيل.

# error_503
source: Service not available
ar: الخدمة غير متوفرة

# error_occurred
source: Unexpected error occurred!
ar: لقد حدث خطأ ما!

source: Welcome
ar: مرحباً

source: Sign in to your account
ar: قم بتسجيل الدخول إلى حسابك

source: Sign in
ar: تسجيل الدخول

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Phone
ar: رقم الهاتف

# emailOrPasswordIsInCorrect
source: Email or password is incorrect. Please try again.
ar: البريد أو كلمة المرور غير صحيح، حاول مرة أخرى!

# dontHaveAnAccount
source: Don't have an account? Sign up
ar: ليس لديك حساب؟ سجل حساب جديد

source: Password must be at least 6 characters
ar: كلمة المرور يجب أن تكون ٦ أحرف على الأقل

source: Forgot Password?
ar: نسيت كلمة المرور؟

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Send Reset Link
ar: إرسال رابط إعادة التعيين

# enterEmailToReset
source: Enter your email address to receive a password reset link
ar: أدخل عنوان بريدك الإلكتروني لتلقي رابط إعادة تعيين كلمة المرور

source: Password Reset Email Sent!
ar: تم إرسال بريد إعادة التعيين!

# checkEmailForResetLink
source: Check your email inbox for a password reset link. If you don't see it, check your spam folder.
ar: تفقد صندوق بريدك الإلكتروني للحصول على رابط إعادة تعيين كلمة المرور. إذا لم تجده، تحقق من مجلد الرسائل غير المرغوب فيها.

source: Back to Sign In
ar: العودة لتسجيل الدخول

source: Email sent successfully
ar: تم إرسال البريد بنجاح

source: Verify Your Email
ar: تحقق من بريدك الإلكتروني

source: Verification Email Sent!
ar: تم إرسال بريد التحقق!

# checkYourInbox
source: We've sent a verification email to
ar: لقد أرسلنا بريد التحقق إلى

# clickLinkInEmail
source: Please click the link in the email to verify your account.
ar: يرجى الضغط على الرابط في البريد للتحقق من حسابك.

source: Email Verification Required
ar: التحقق من البريد مطلوب

# pleaseVerifyEmail
source: Please verify your email address to continue
ar: يرجى التحقق من عنوان بريدك الإلكتروني للمتابعة

source: Resend Verification Email
ar: إعادة إرسال بريد التحقق

source: Resend in
ar: إعادة الإرسال خلال

source: seconds
ar: ثانية

# wrongEmailQuestion
source: Wrong email?
ar: البريد خاطئ؟

source: Change Email
ar: تغيير البريد

# verificationCheckInProgress
source: Checking verification status...
ar: جارٍ التحقق من الحالة...

source: Email verified successfully!
ar: تم التحقق من البريد بنجاح!

source: Redirecting to home...
ar: جارٍ التوجيه للصفحة الرئيسية...

# didNotReceiveEmail
source: Didn't receive the email?
ar: لم تتلقَ البريد؟

# checkSpamFolder
source: Check your spam folder
ar: تحقق من مجلد الرسائل غير المرغوب فيها

source: Open Email App
ar: فتح تطبيق البريد

# verifyAndContinue
source: I've Verified, Continue
ar: تم التحقق، المتابعة

# tooManyRequestsError
source: Too many requests. Please wait a moment and try again.
ar: طلبات كثيرة جداً. يرجى الانتظار قليلاً والمحاولة مرة أخرى.

# authEmailAlreadyInUseError
source: This email is already registered. Please sign in.
ar: هذا البريد مسجل بالفعل. يرجى تسجيل الدخول.

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Settings
ar: الإعدادات

source: Profile Settings
ar: إعدادات الملف الشخصي

source: App Settings
ar: إعدادات التطبيق

source: Theme
ar: المظهر

# lightTheme
source: Light
ar: فاتح

# darkTheme
source: Dark
ar: داكن

source: Language
ar: اللغة

source: Select Your Preferred Language
ar: اختر لغتك المفضلة

source: My Profile
ar: الملف الشخصي

source: Full Name
ar: الاسم الكامل

source: Enter Your Name
ar: أدخل الاسم الشخصي

source: Mobile Number
ar: رقم الهاتف

source: Enter Your Number
ar: أدخل رقم الهاتف

source: Home
ar: الرئيسية

# please_enable_location_service
source: Please enable location services, and try again
ar: الرجاء تمكين خدمة الموقع ، وحاول مرة أخرى...

# location_permission_required
source: Without location permission you can't deliver orders
ar: بدون إذن الموقع لا يمكنك توصيل الطلبات

# tracking_permission_required
source: Without tracking permission you can't deliver orders
ar: بدون إذن التتبع لا يمكنك توصيل الطلبات

# location_timeout_error
source: It takes long time, please check your internet connection and try again
ar: يستغرق الأمر وقتًا طويلاً ، يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى

source: Please wait
ar: الرجاء الإنتظار

# determine_location
source: Please wait until your location is determined.
ar: الرجاء الإنتظار حتى يتم تحديد موقعك

# thereAreNoOrders
source: There"re no orders to be delivered.
ar: لا يوجد طلبات في الوقت الحالي.

source: Order Upcoming
ar: الطلب جاهز

source: Order OnTheWay
ar: الطلب في الطريق

source: Details
ar: التفاصيل

source: Deliver
ar: قم بالتوصيل

source: Show Map
ar: أظهر الخريطة

source: Order Details
ar: تفاصيل الطلب

source: Order Items
ar: عناصر الطلب

source: Quantity
ar: الكمية

source: Subtotal
ar: المجموع الفرعي

source: Delivery Fee
ar: رسوم التوصيل

source: Total
ar: الإجمالي

# currency
source: EGP
ar: ج.م

# noItemsInOrder
source: No items in this order
ar: لا توجد عناصر في هذا الطلب

source: Id
ar: الرمز

source: Status
ar: النوع

source: Payment
ar: الدفع

source: User Details
ar: بيانات المستخدم

source: Note
ar: ملاحظة

source: None
ar: لا يوجد

source: Reason for canceling the order
ar: سبب إلغاء الطلب

source: Type your note
ar: اكتب ملاحظتك

source: Are you sure?
ar: هل أنت متأكد؟

source: Cancel the order?
ar: إلغاء الطلب؟

source: Submit Excuse
ar: تقديم اعتذار

source: Available
ar: متاح

source: Unavailable
ar: غير متاح

source: Reason for Rejection
ar: سبب رفض الطلب

# typeYourReason
source: Type your reason for rejecting the order
ar: اكتب سبب رفضك للطلب

# excuseSubmissionNote
source: Note: Your request will be sent to admin for review and you'll receive a decision soon
ar: ملاحظة: سيتم إرسال طلبك للإدارة للمراجعة وستتلقى قراراً قريباً

# submitExcuseQuestion
source: Submit excuse for this order?
ar: تقديم اعتذار عن هذا الطلب؟

# waitingAdminReview
source: Waiting for admin review
ar: في انتظار مراجعة الإدارة

source: Excuse submitted successfully
ar: تم تقديم الاعتذار بنجاح

# cannotSubmitExcuse
source: Cannot submit excuse now
ar: لا يمكن تقديم الاعتذار الآن

source: Do you want to Deliver the order?
ar: هل تريد توصيل هذا الطلب؟

source: Do you want to Confirm the order?
ar: هل تريد تأكيد توصيل هذا الطلب؟

# youCanNotProceedThisOrder
source: You can"t proceed this order!
ar: لا يمكنك تنفيذ هذا الطلب!

# youCanOnlyProceedOrdersYouDelivering
source: You can only proceed orders that you"re delivering.
ar: يمكنك تنفيذ الطلبات التي تقوم بتوصيلها فقط.

source: Arrived Location!
ar: تم الوصول للموقع!

# youAreCloseToLocationArea
source: You"re close to location area. Order delivery confirmation has enabled.
ar: أنت قريب من الموقع. تم تفعيل تأكيد الطلب.

source: Search for a place...
ar: ابحث عن موقع...

source: My current location
ar: موقعي الحالي

# pleaseSearchForLocation
source: Please search for the location!
ar: الرجاء البحث عن الموقع!

# userHasNotProvidedLocation
source: User hasn't provided his location point.
ar: المستخدم لم يوفر موقعه الشخصي.

source: Map Not Available on Web
ar: الخريطة غير متاحة على الويب

# pleaseUseMobileAppForMapFeatures
source: Please use the mobile app (Android/iOS) to access map features and navigation.
ar: يرجى استخدام تطبيق الهاتف (أندرويد/iOS) للوصول إلى ميزات الخريطة والملاحة.

source: My Orders
ar: طلباتي

source: All
ar: الكل

source: On The Way
ar: في الطريق

source: Delivered
ar: تم التوصيل

source: No orders found.
ar: لا توجد طلبات.

# driverApplicationTitle
source: Driver Application
ar: طلب الانضمام كسائق

# driverApplicationSubtitle
source: Complete the form below to apply as a delivery driver
ar: أكمل النموذج أدناه للتقدم كسائق توصيل

# personalInfo
source: Personal Information
ar: المعلومات الشخصية

# licenseInfo
source: License Information
ar: معلومات الرخصة

# vehicleInfo
source: Vehicle Information
ar: معلومات المركبة

source: Documents
ar: المستندات

source: Additional Notes
ar: ملاحظات إضافية

source: ID Number
ar: رقم الهوية

source: License Number
ar: رقم الرخصة

source: License Expiry Date
ar: تاريخ انتهاء الرخصة

source: Vehicle Type
ar: نوع المركبة

source: Vehicle Plate
ar: لوحة المركبة

source: Personal Photo
ar: الصورة الشخصية

source: ID Document
ar: صورة الهوية

source: License Document
ar: صورة الرخصة

source: Vehicle Registration
ar: استمارة المركبة

source: Vehicle Insurance
ar: تأمين المركبة

source: Notes
ar: ملاحظات

source: Select Date
ar: اختر التاريخ

# requiredField
source: This field is required
ar: هذا الحقل مطلوب

source: Submit Application
ar: تقديم الطلب

source: Car
ar: سيارة

source: Motorcycle
ar: دراجة نارية

source: Bicycle
ar: دراجة هوائية

source: No Application Found
ar: لا يوجد طلب انضمام

# submitApplicationToJoin
source: Submit an application to join as a delivery driver
ar: قدم طلباً للانضمام كسائق توصيل

source: Application Pending
ar: الطلب قيد الانتظار

source: Application Under Review
ar: الطلب قيد المراجعة

source: Application Approved
ar: تم قبول الطلب

source: Application Rejected
ar: تم رفض الطلب

# applicationPendingMessage
source: Your application has been submitted and is pending review
ar: تم تقديم طلبك بنجاح وهو قيد الانتظار للمراجعة

# applicationUnderReviewMessage
source: Your application is being reviewed by our team
ar: طلبك قيد المراجعة من قبل فريقنا

# applicationApprovedMessage
source: Congratulations! Your application has been approved. You can now start working
ar: مبروك! تم قبول طلبك ويمكنك الآن بدء العمل

# applicationRejectedMessage
source: Unfortunately, your application has been rejected. You can apply again
ar: للأسف تم رفض طلبك. يمكنك التقدم مرة أخرى

source: Rejection Reason
ar: سبب الرفض

source: Resubmit Application
ar: إعادة تقديم الطلب

source: Sign Out
ar: تسجيل الخروج

source: Application Details
ar: تفاصيل الطلب

source: Submitted At
ar: تاريخ التقديم

source: Attention
ar: تنبيه

# enterValidEgyptianPhone
source: Enter a valid Egyptian phone number
ar: أدخل رقم هاتف مصري صحيح

# idNumberLengthError
source: ID Number must be 14 digits
ar: رقم الهوية يجب أن يتكون من 14 رقم

# licenseNumberLengthError
source: License Number must be 14 digits
ar: رقم الرخصة يجب أن يتكون من 14 رقم

# uploadAllRequiredImages
source: Please upload all required images (Personal Photo, ID, License, Registration, Insurance).
ar: الرجاء رفع جميع الصور المطلوبة (الصورة الشخصية، الهوية، الرخصة، الاستمارة، التأمين).

# pleaseEnterValidVehiclePlate
source: Please enter a valid vehicle plate (Numbers followed by Arabic letters).
ar: الرجاء إدخال رقم لوحة صحيح (أرقام متبوعة بحروف عربية).

# accountInfo
source: Account Information
ar: معلومات الحساب

source: Confirm Password
ar: تأكيد كلمة المرور

source: Passwords do not match
ar: كلمات المرور غير متطابقة

# fillAllFields
source: Please fill all required fields
ar: الرجاء ملء جميع الحقول المطلوبة

source: Next
ar: التالي

source: Previous
ar: السابق

# alreadyHaveAccount
source: Already have an account? Sign In
ar: لديك حساب بالفعل؟ سجل دخول

# documentsUploadLater
source: Document upload will be available after approval. You can continue without uploading documents now.
ar: سيتم رفع المستندات بعد الموافقة. يمكنك المتابعة بدون رفع المستندات الآن.

# applicationSubmitted
source: Application Submitted Successfully!
ar: تم تقديم الطلب بنجاح!

# applicationSubmittedDesc
source: Your application will be reviewed by our team. You will receive an email notification once your application is approved. Please sign in after receiving the approval email.
ar: سيتم مراجعة طلبك من قبل فريقنا. ستصلك رسالة بريد إلكتروني عند قبول طلبك. يرجى تسجيل الدخول بعد استلام رسالة الموافقة.

source: Data updated successfully
ar: تم تحديث البيانات بنجاح

source: Edit Profile
ar: تعديل الملف الشخصي

source: Excuse Refused
ar: تم رفض الاعتذار

# mustDeliverOrder
source: You must deliver this order
ar: يجب عليك توصيل هذا الطلب إلزامياً

# refusalReason
source: Reason
ar: السبب

# pendingAdminReview
source: Orders pending review
ar: طلبات بانتظار المراجعة

# buttonsDisabledUntilReview
source: Actions disabled until admin reviews your request
ar: الأزرار معطلة لحين مراجعة الإدارة لطلبك
